IdeaRS.Connections
Plate2PlateData Properties
Compatible with IDEA StatiCa 0.0
The Plate2PlateData type exposes the following members.
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
ConnectionType
 Gets or sets the type of connection of two parts.
 (Inherited from EndPlateDataBase.)
Fastening
 Gets or sets the properties of the anchoring
FlangesWeld
 Gets or sets the properties of the weld - flanges
InnerRadius
 Gets or sets the inner radius of the circular plate boundary.
 (Inherited from EndPlateDataBase.)
IsActive |  (Inherited from ConnectionCmdData.)
IsWeld
 If true welds are generated automatically
Member1
 Gets or sets the first connected member
Member2
 Gets or sets the second connected member
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OffsetBottom
 Gets or sets the bottom offset of the end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
 (Inherited from EndPlateDataBase.)
OffsetLeft
 Gets or sets the left offset of the end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
 (Inherited from EndPlateDataBase.)
OffsetRight
 Gets or sets the right offset of the end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
 (Inherited from EndPlateDataBase.)
OffsetTop
 Gets or sets the top offset of the end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
 (Inherited from EndPlateDataBase.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
OuterRadius
 Gets or sets the outer radius of the circular plate boundary.
 (Inherited from EndPlateDataBase.)
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
PlateSizeMethod
 Gets or sets the method of the definition of dimensions of the plate
 (Inherited from EndPlateDataBase.)
PositionOnMember1
 Gets or sets the position of the plate (measured on the reference line of the beam segment)
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
Weld
 Gets or sets the properties of the weld - other parts
Top
See Also
Reference
Plate2PlateData Class
IdeaRS.Connections.Data Namespace